<center><h2>DS102 Problem Set - Week 2</h2></center>
**Hackwagon Academy**

`HWA-DS102-PS2-201810`
<hr>

If you have any questions to the Problem Set, feel free to send a message to your TAs or Instructors in the Telegram chat. You are encouraged to also discuss the problem sets within your own groups.

<div class="alert alert-success">
Before you start, fill in your details for this notebook and rename the notebook to `<First_Name>_<Last_Name>-problem-set-week-2`, for example `jane-doe-problem-set-week-2`.</div>

In [24]:
# Rename the notebook. Then, fill in your details here.
# Name  : Victor Wong
# Class :  DS102 Thursday 7pm

# 100/100

#### Datasets Required:

- `employees-200.csv`

- `PASSNYC-schools.csv`

### Part 1 (7 Marks)

You are a Human Resource (HR) analyst in a large company. The income for all your employees is given to you in `employees-200.csv`. This is taken from the [Lending Club Loan Data](https://www.kaggle.com/wendykan/lending-club-loan-data) dataset. The details of each column is as follows:

<p></p>
<center>`employees-200.csv`</center>

| col name | definition | datatype | example |
| -------- | ---------- | -------- | ------- |
| employee_id | The unique ID assigned to an employee| int | 4428518 |
| annual_inc | The annual income of the employee, in USD| float | 104000.0 |

Using the dataset, answer the following questions. Mark breakdowns are stated in the question e.g. **`[1]`**. <span style="color:darkblue">**Where stated, both the <u>code</u> and <u>typed answers</u> must be provided to receive full credit.**</span>

In [25]:
# import the relevant packages
import pandas as pd
import numpy as np
# additional options
pd.options.display.float_format = '{:,.1f}'.format

** Read from CSV to `df`**

Read the data from the `employees-200.csv` CSV file into a `DataFrame` called `emp_df`.

In [26]:
# Read the data from the CSV file to emp_df. 
# Write your code here
emp_df = pd.read_csv('employees-200.csv')

**1A**.

**i)** Use `describe()` to get the summary statistics of the dataset.  **`[0.5]`**

In [27]:
# Use describe() to get the summary statistics of the dataset.
# Write your code here
emp_df.describe()

       employee_id  annual_inc
count        200.0       200.0
mean  31,894,096.2    73,486.1
std   23,817,072.2    40,056.2
min      240,443.0    16,000.0
25%    9,582,660.5    50,000.0
50%   26,327,490.0    64,250.0
75%   55,890,970.5    85,000.0
max   73,089,928.0   250,000.0

Using the result of `describe()`, answer the following questions:

**ii) ** What is the $25$th percentile of the `annual_inc` column? **`[0.5]`**

In [28]:
# What is the 25th percentile of annual_inc?
# Code is not required.

# (Type your answer here)
# 50,000 (from .describe())

**iii) ** What is the $75$th percentile of the `annual_inc` column?**`[0.5]`**

In [29]:
# What is the 75th percentile of annual_inc?
# Code is not required.
# (Type your answer here)
# 85,000 (from .describe())

**iv) ** Another way to find the $25$th percentile of `annual_inc` is to use the `percentile` function from the `numpy` library. It has already been `import`ed for you. Using [this StackOverflow answer](https://stackoverflow.com/questions/23228244/how-do-you-find-the-iqr-in-numpy) to help you or otherwise, assign the $25$th percentile and $75$th percentile of `annual_inc` to two variables, `p25` and `p75` respectively. 

Hint: The code for `p25` is already completed for you. **`[0.5]`**

In [30]:
# The code for p25 is already completed for you.
p25 = np.percentile(emp_df['annual_inc'], 25)
print(p25)

# Write your code for p75 here
p75 = np.percentile(emp_df['annual_inc'], 75)
print(p75)

50000.0
85000.0

**v) ** Using the solution to **iv)** or otherwise, find the interquartile range of the `annual_inc` column. **`[1]`**

In [31]:
# What is the interquartile range
# of the annual_inc column?
# Write your code here.
iqr = p75 - p25
print(iqr)

# (Type your answer here)
# 35000

35000.0

**1B**. 

**i)** An **income tax** is imposed on the annual income of all employees. The tax is calculated as follows:

- if the employee's annual income is $\$65,000$ or less, the employee does not need to pay tax
- if the employee's annual income is more than $\$65,000$ the employee needs to pay a tax equal to $7.5\%$ of his/her annual income

Mathematically, for an employee with an income of $\$annual\_income$, the amount of tax the employee needs to pay, or the $\$tax$ is:

$$
tax = \begin{cases}
0 & \text{ if } annual\_income \leq 65000\\
0.075 \times annual\_income & \text{ if } annual\_income > 65000\\\end{cases}
$$

Using the information above, answer the following questions:

- What is the $tax$ if $annual\_income=84200.0$?
- What is the $tax$ if $annual\_income=60000.0$?
- What is the $tax$ if $annual\_income=127000.0$?

**`[1]`**

In [32]:
# Code is not required. However, you could use this line of code to help you
# 0.075*65000

# What is the tax if annual_income = 84200.0?  
0.075 * 84200

# (Type your answer here)
# $6315

# What is the tax if annual_income = 60000.0? 
# (Type your answer here)
# $0

# What is the tax if annual_income = 127000.0? 
0.075 * 127000

# (Type your answer here)
# $9525

9525.0

**ii)** The function `calculate_income_tax(annual_inc)` is given to you. It takes in `annual_inc` as a `float()` and `return`s the tax payable based on the annual income, according to the logic given by **i)**. 

`calculate_income_tax` has errors in the logic of the code. Debug the function `calculate_income_tax(annual_inc)` so that the correct tax is calculated and `return`ed. 

Hint: test the logic of the code using `calculate_income_tax(84200.0)`. It should match the answers you have given in **i)**. **`[0.5]`**

In [33]:
# Debug calculate_income_tax(annual_inc) so that the correct tax is calculated and returned
def calculate_income_tax(annual_inc):
    if annual_inc > 65000:
        return annual_inc * 0.075
    else:
        return 0
    
    
# Use the following lines of code to help you validate your answer.
print(calculate_income_tax(84200))

6315.0

**iii)** Using the solution to **ii)** or otherwise, create a new column `tax` in `emp_df` which contains the tax calculated based on the employer's annual income. 

Hint: Use `df.apply()`. **`[1]`**

In [35]:
# Create a new column 'tax' in emp_df which is the tax calculated on the annual income.

# Write your code here
emp_df['Tax'] = emp_df['annual_inc'].apply(calculate_income_tax)
emp_df

     employee_id  annual_inc      Tax
0       32718328    84,200.0  6,315.0
1        4428518    60,000.0      0.0
2       11031023   127,000.0  9,525.0
3       44276470    75,000.0  5,625.0
4       64547736   104,000.0  7,800.0
5        7417960    48,000.0      0.0
6       32888938    85,000.0  6,375.0
7        4419452    90,000.0  6,750.0
8        4153263    85,000.0  6,375.0
9       25466112    58,000.0      0.0
10      66692274   127,000.0  9,525.0
11      48063881    31,500.0      0.0
12      59429348   145,000.0 10,875.0
13        539049    51,996.0      0.0
14      22363030    78,000.0  5,850.0
15       9044906    70,000.0  5,250.0
16      16170322    60,000.0      0.0
17       1075130   148,500.0 11,137.5
18      14258048    55,000.0      0.0
19      57779211   185,000.0 13,875.0
20      35002597    40,000.0      0.0
21      62464110    50,400.0      0.0
22      40573856    16,000.0      0.0
23      19015223    55,000.0      0.0
24      12457271    57,000.0      0.0
25      41302161    38,000.0      0.0
26      14958083   130,000.0  9,750.0
27      14638919    56,000.0      0.0
28      10799787    68,000.0  5,100.0
29      68439586    16,000.0      0.0
..           ...         ...      ...
170     24043936    75,000.0  5,625.0
171      4672272    80,000.0  6,000.0
172     10761172   117,478.4  8,810.9
173      4431101   160,000.0 12,000.0
174     16682779    32,000.0      0.0
175     45440822   108,000.0  8,100.0
176     14978604    60,000.0      0.0
177      8449957    38,937.6      0.0
178     25986418    82,000.0  6,150.0
179     65452929    39,000.0      0.0
180     55328571    66,000.0  4,950.0
181     72648159    84,840.0  6,363.0
182     63385929   100,000.0  7,500.0
183     12649364    80,000.0  6,000.0
184      8083256    40,000.0      0.0
185     60828625    39,000.0      0.0
186      8477585    70,000.0  5,250.0
187     11927992   120,000.0  9,000.0
188     12097315    50,000.0      0.0
189     32888170    45,058.0      0.0
190      4673031    53,000.0      0.0
191     43985353    48,000.0      0.0
192     39042336    62,000.0      0.0
193     63009914    85,000.0  6,375.0
194     73030174    94,500.0  7,087.5
195     10296814    74,000.0  5,550.0
196     62695297   160,000.0 12,000.0
197     43818420    52,000.0      0.0
198     27238924    60,000.0      0.0
199     15078641    63,000.0      0.0

[200 rows x 3 columns]

**iv) ** Using your solution from **iii)** or otherwise, find the total amount of tax collected from all employees in the dataset? **`[0.5]`**

In [36]:
# What is the total amount of tax collected from all employees in the dataset?
# Write your code here
emp_df['Tax'].sum()

# (Type your answer here)
# 720110.88

720110.88

**v) ** Using your solution from **iii)** or otherwise, find out how many percent of the **total** annual income  of all employees which was tax. **`[0.5]`**

Hint: the calculation is $\frac{\text{total income tax paid by all employees}}{\text{total income earned by all employees}}$.

In [37]:
# How many percent of the total annual income of all employees was income tax?
# Write your code here
emp_df['Tax'].sum()/emp_df['annual_inc'].sum()

# (Type your answer here)
# 4.90%

0.04899640147994902

**vi) ** Using your solution from **iii)** or otherwise, find out the number of employees who did not have to pay any tax. **`[0.5]`**

In [44]:
# How many employees did not have to pay any tax, or their tax was $0.0?
# Write your code here
# emp_df.groupby('Tax').size().reset_index(name = 'Freq').head()

#OR
# emp_df[emp_df['tax'] == 0]['employee_id'].count()
# np.sum(emp_df['Tax'] == 0)

# (Type your answer here)
# 106

106

<div class="alert alert-success">
**Checkpoint**: When you have completed Part 1, upload your progress to eLearn. eLearn only accepts the latest notebooks so if you have an existing notebook, your latest upload will **override** it.
</div>

### Part 2 (5 Marks)

The dataset `PASSNYC-schools.csv` is given to you. This is taken from the [PASSNYC: Data Science for Good](https://www.kaggle.com/passnyc/data-science-for-good/home) dataset.  The definition of each column is as follows:

<p></p>
<center>`PASSNYC-schools.csv`</center>

| col name | definition | datatype | example |
| -------- | ---------- | -------- | ------- |
| School Name | The name of a school | str | ICAHN CHARTER SCHOOL 2	 |
| Location Code | The location code of a school | str | 84X378 |
| District | The district code of a school | int | 8 |
| New? | An indicator of whether the school is new. `Y` indicates that the school is new while `N` indicates that the school is not new  | str | `Y` |


Using the dataset, answer the following questions. Mark breakdowns are stated in the question e.g. **`[1]`**. <span style="color:darkblue">**Where stated, both the <u>code</u> and <u>typed answers</u> must be provided to receive full credit.**</span>

Read the dataset into a `DataFrame` called `schools_df`.

In [45]:
# Read the data from the CSV file to schools_df. 
# Write your code here
schools_df = pd.read_csv('PASSNYC-schools.csv')

In [46]:
# Optional: modify the value of h so that the first 15 records in the dataset is displayed

h = 15
print(schools_df.head(h))

                              School Name Location Code  District New?
0               P.S. 015 ROBERTO CLEMENTE        01M015         1    Y
1                     P.S. 019 ASHER LEVY        01M019         1    Y
2                    P.S. 020 ANNA SILVER        01M020         1    Y
3          P.S. 034 FRANKLIN D. ROOSEVELT        01M034         1    Y
4               THE STAR ACADEMY - P.S.63        01M063         1    Y
5                   P.S. 064 ROBERT SIMON        01M064         1    Y
6           P.S. 110 FLORENCE NIGHTINGALE        01M110         1    Y
7                P.S. 134 HENRIETTA SZOLD        01M134         1    Y
8                  P.S. 140 NATHAN STRAUS        01M140         1    Y
9                  P.S. 142 AMALIA CASTRO        01M142         1    Y
10                   P.S. 184M SHUANG WEN        01M184         1    Y
11             P.S. 188 THE ISLAND SCHOOL        01M188         1    Y
12             ORCHARD COLLEGIATE ACADEMY        01M292         1    Y
13  TECHNOLOGY, ARTS, AND SCIENCES STUDIO        01M301         1    Y
14      THE EAST VILLAGE COMMUNITY SCHOOL        01M315         1    Y

**2A.** 

**(i)** Using `Series.unique()` or otherwise, find all the unique `District`s in the dataset. **`[0.5]`**

In [47]:
# Write the code to show the unique Districts here.
schools_df['District'].unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       23, 18, 19, 20, 21, 22, 24, 25, 26, 27, 28, 29, 30, 31, 32],
      dtype=int64)

**(ii)** How many unique `Districts` are there? **`[0.5]`**

In [48]:
# How many unique Districts are there in the dataset?
# You might write any code to help you here.
len(schools_df['District'].unique())

# (Type your answer here)
#  32

32

**(iii)** Using `df.groupby()` or otherwise, create a new `df` with two columns. The first column labelled `District` and contains the District number. The second column is called `Number of Schools` and contains the number of schools in the disctrict. Do this for **only** schools in `District` numbers `1`, `2`, `3`, `4` and `5`. **`[1]`**

In [50]:
# Write your code here to create the aggregated df.
required_schools_df = schools_df.copy()
required_district = ['1', '2', '3', '4', '5']
required_schools_df = required_schools_df[required_schools_df['District'].isin(required_district)]

required_schools_df.groupby('District').size().reset_index(name = 'Number of Schools')

   District  Number of Schools
0         1                 27
1         2                 53
2         3                 41
3         4                 33
4         5                 36

**2B.** What is the interpretation of the the pivot table given to you in the code? **`[2]`**

In [51]:
# Uncomment the following lines of code to show the pivot table.
pivot_tbl_df = pd.pivot_table(schools_df[['District', 'New?']], 
                index='District', 
                columns=['New?'], 
                aggfunc=len).fillna(0)
pivot_tbl_df['N'] = pivot_tbl_df['N'].apply(np.int)
pivot_tbl_df['Y'] = pivot_tbl_df['Y'].apply(np.int)
pivot_tbl_df

# What is the interpretation of the the pivot table?
# (Type your answer here)
# Each row represents a district
# Each column represents the schools that are new or old in a district
# Each cell represents the number of schools that are new/old in each district

New?      N   Y
District
1         0  27
2         4  49
3         2  39
4         1  32
5         1  35
6         1  42
7         3  38
8         1  42
9         0  62
10        1  60
11        1  49
12        0  40
13        1  35
14        1  34
15        2  40
16        0  27
17        3  38
18        2  27
19        1  43
20        0  39
21        0  31
22        0  33
23        0  32
24        1  39
25        0  35
26        0  28
27        0  50
28        1  38
29        0  38
30        0  41
31        0  60
32        0  22

**2C.** In which districts are the number of schools more than the **mean** number of schools per district? **`[1]`**

In [52]:
# In which districts are the number of schools more than 
# the mean number of schools of all districts in the dataset?
# Write your code here
number_of_districts = schools_df['District'].nunique()
number_of_schools = schools_df['School Name'].nunique()

mean = number_of_schools / number_of_districts

num_schools_df = schools_df.groupby('District').size().reset_index(name = 'Number of Schools')
num_schools_df = num_schools_df[num_schools_df['Number of Schools'] > mean]
list_of_districts = list(num_schools_df['District'])
list_of_districts

# (Type your answer here)
# [2, 3, 6, 7, 8, 9, 10, 11, 12, 15, 17, 19, 24, 27, 30, 31]

[2, 3, 6, 7, 8, 9, 10, 11, 12, 15, 17, 19, 24, 27, 30, 31]

<div class="alert alert-success">
**Checkpoint**: When you have completed Part 2, upload your progress to eLearn. eLearn only accepts the latest notebooks so if you have an existing notebook, your latest upload will **override** it.
</div>